docs/inlining-monads.org
#+html_head: <link rel="stylesheet" href="https://xieyuheng.github.io/asset/css/page.css" type="text/css" media="screen" />
#+title: inlining monads

* intro

  - state monad is exactly what I need when writing interpreters.
    I need to pass environment as extra argument through an interpreter,
    this extra argument can be captured by state monad.

  - I implemented state moand,
    and tried to understand how it works, by inline it.

  - by doing so,
    I found that,
    in a concatenative languages,
    I do not need to use state moand by its traditional interface.

* number-tree

*** tree

    #+begin_src jojo
    (+data <leaf> .v)
    (+data <node> .l .r)

    (+jojo tree-write :f! :t!
      (case :t
        <leaf> [:t .v :f apply "leaf" string-write space]
        <node> [:t .l :f (recur)
                :t .r :f (recur) "node" string-write space]))

    (+jojo tree-map :f! :t!
      (case :t
        <leaf> [:t .v :f apply leaf]
        <node> [:t .l :f (recur)
                :t .r :f (recur) node]))
    #+end_src

*** number-tree -- state monad

    #+begin_src jojo
    (+jojo return-state
      (note (-> <v> -- (-> <s> -- <s> <v>)))
      :v!
      (% :v))

    (+jojo bind-state
      (note (-> (-> <s> -- <s> <v1>)
                (-> <v1> -- (-> <s> -- <s> <v2>))
             -- (-> <s> -- <s> <v2>)))
      :f! :m!
      (% :m apply :f apply apply))

    (+jojo tick
      (note (-> <int> -- <int> <int>))
      dup inc swap)

    (+jojo number-tree
      (note (-> :<t> <tree>
             -- (-> <int> -- <int> <tree>)))
      :t!
      (case :t
        <leaf> [(% tick)
                (% :s! :s leaf return-state)
                bind-state]
        <node> [:t .l number-tree
                (% :l! :t .r number-tree
                   (% :r! :l :r node return-state)
                   bind-state)
                bind-state]))
    #+end_src

