docs/inlining-monads.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-20 Sun 16:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>inlining monads</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="XIE Yuheng" />
<link rel="stylesheet" href="https://xieyuheng.github.io/asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
.
</div>
<div id="content">
<h1 class="title">inlining monads</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9775593">intro</a></li>
<li><a href="#orgd220d42">number-tree</a>
<ul>
<li><a href="#orge0d0136">tree</a></li>
<li><a href="#orga2ec711">number-tree &#x2013; state monad</a></li>
<li><a href="#orgf484c71">number-tree &#x2013; inline</a></li>
<li><a href="#org5c29b05">number-tree &#x2013; inline and uncurry</a></li>
<li><a href="#org1698c4b"><span class="done _test_">[test]</span> number-tree</a></li>
</ul>
</li>
<li><a href="#orgc2b9b62">zip-tree</a>
<ul>
<li><a href="#orge1f10ae"><span class="todo _note_">[note]</span> </a></li>
<li><a href="#org2cc0a22">zip-tree &#x2013; do not handle error</a></li>
<li><a href="#org27918d9">zip-tree &#x2013; maybe</a></li>
<li><a href="#org69e2f49">zip-tree &#x2013; maybe monad</a></li>
<li><a href="#orgbf1cea8"><span class="done _test_">[test]</span> zip-tree &#x2013; maybe</a></li>
<li><a href="#org1875af6">zip-tree &#x2013; inline and uncurry</a></li>
<li><a href="#orgcf8a9f6"><span class="done _test_">[test]</span> zip-tree</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9775593" class="outline-2">
<h2 id="org9775593">intro</h2>
<div class="outline-text-2" id="text-org9775593">
<ul class="org-ul">
<li><p>state monad is exactly what I need when writing interpreters.</p><p>I need to pass environment as extra argument through an interpreter,</p><p>this extra argument can be captured by state monad.</p></li>

<li><p>I implemented state moand,</p><p>and tried to understand how it works, by inline it.</p></li>

<li><p>by doing so,</p><p>I found that,</p><p>in a concatenative languages,</p><p>I do not need to use state moand by its traditional interface.</p></li></ul>
</div>
</div>

<div id="outline-container-orgd220d42" class="outline-2">
<h2 id="orgd220d42">number-tree</h2>
<div class="outline-text-2" id="text-orgd220d42">
</div><div id="outline-container-orge0d0136" class="outline-3">
<h3 id="orge0d0136">tree</h3>
<div class="outline-text-3" id="text-orge0d0136">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;leaf&gt;</span> .v<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;node&gt;</span> <span style="color: #ae81ff;">.l</span> .r<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> tree-write <span style="color: #fd971f;">:f!</span> <span style="color: #fd971f;">:t!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:t</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;leaf&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.v</span> <span style="color: #a6e22e;">:f</span> apply <span style="color: #e6db74;">"leaf"</span> string-write space<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;node&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.l</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">recur</span><span style="color: #696969;">)</span>
            <span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.r</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">recur</span><span style="color: #696969;">)</span> <span style="color: #e6db74;">"node"</span> string-write space<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> tree-map <span style="color: #fd971f;">:f!</span> <span style="color: #fd971f;">:t!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:t</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;leaf&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.v</span> <span style="color: #a6e22e;">:f</span> apply leaf<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;node&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.l</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">recur</span><span style="color: #696969;">)</span>
            <span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.r</span> <span style="color: #a6e22e;">:f</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">recur</span><span style="color: #696969;">)</span> node<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2ec711" class="outline-3">
<h3 id="orga2ec711">number-tree &#x2013; state monad</h3>
<div class="outline-text-3" id="text-orga2ec711">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> return-state
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;v&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;s&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;s&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;v&gt;</span><span style="color: #696969;">)))</span>
  <span style="color: #fd971f;">:v!</span>
  <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> :v<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> bind-state
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;s&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;s&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;v1&gt;</span><span style="color: #696969;">)</span>
            <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;v1&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;s&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;s&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;v2&gt;</span><span style="color: #696969;">))</span>
         <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;s&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;s&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;v2&gt;</span><span style="color: #696969;">)))</span>
  <span style="color: #fd971f;">:f!</span> <span style="color: #fd971f;">:m!</span>
  <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> <span style="color: #a6e22e;">:m</span> apply <span style="color: #a6e22e;">:f</span> apply apply<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> tick
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #696969;">))</span>
  dup inc swap<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> number-tree
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span>
         <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span><span style="color: #696969;">)))</span>
  <span style="color: #fd971f;">:t!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:t</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;leaf&gt;</span> <span style="color: #797979;">[</span><span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> tick<span style="color: #696969;">)</span>
            <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> <span style="color: #fd971f;">:s!</span> <span style="color: #a6e22e;">:s</span> leaf return-state<span style="color: #696969;">)</span>
            bind-state<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;node&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.l</span> number-tree
            <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> <span style="color: #fd971f;">:l!</span> <span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.r</span> number-tree
               <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> <span style="color: #fd971f;">:r!</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:r</span> node return-state<span style="color: #696969;">)</span>
               bind-state<span style="color: #696969;">)</span>
            bind-state<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
