docs/inlining-monads.org
*** number-tree -- inline

    #+begin_src jojo
    (+jojo tick
      (note (-> <int> -- <int> <int>))
      :x! :x inc :x)

    (+jojo number-tree
      (note (-> :<t> <tree> -- (-> <int> -- <int> <tree>)))
      :t!
      (case :t
        <leaf> (% :x! :x inc :x leaf)
        <node> (% :t .l number-tree apply :l!
                  :t .r number-tree apply :r!
                  :l :r node)))
    #+end_src

*** number-tree -- inline and uncurry

    #+begin_src jojo
    (+jojo number-tree
      (note (-> <int>, :<t> <tree> -- <int>, <int> <tree>))
      :t!
      (case :t
        <leaf> [dup inc swap leaf]
        <node> [:t .l (recur) :l!
                :t .r (recur) :r!
                :l :r node]))
    #+end_src

*** [test] number-tree

    #+begin_src jojo
    (+jojo test-number-tree
      0 swap number-tree
      swap drop
      (% int-write space) tree-write newline)

    (+var tree-1
      "1" leaf "2" leaf node
      "3" leaf "4" leaf node
      "5" leaf node
      node)

    (run tree-1 test-number-tree)
    #+end_src

* zip-tree

*** [note]

    - the experiment gose in three steps
      1. implement the moand
      2. inline and simplify
      3. uncurry and simplify

    - here is the experiment applies to maybe monad

*** zip-tree -- do not handle error

    #+begin_src jojo
    (+jojo zip-tree :t1! :t2!
      (note [tree tree] -- [tree])
      (cond [:t1 leaf? :t2 leaf? and] [:t1 .v :t2 .v cons leaf]
            [:t1 node? :t2 node? and] [:t1 .l :t2 .l (recur)
                                       :t1 .r :t2 .r (recur) node]))
    #+end_src

*** zip-tree -- maybe

    #+begin_src jojo
    (+jojo zip-tree :t1! :t2!
      (note (-> :<t> <tree> :<t> <tree> -- [:<t> <tree> <maybe>]))
      (cond [:t1 leaf? :t2 leaf? and]
            [:t1 .v :t2 .v cons leaf just]
            [:t1 node? :t2 node? and]
            (case [:t1 .l :t2 .l (recur) dup :lm!]
              <nothing> nothing
              <just> (case [:t1 .r :t2 .r (recur) dup :rm!]
                       <nothing> nothing
                       <just> [:lm .v :rm .v node just]))
            else nothing))
    #+end_src

