docs/inlining-monads.html

<div id="outline-container-orgf484c71" class="outline-3">
<h3 id="orgf484c71">number-tree &#x2013; inline</h3>
<div class="outline-text-3" id="text-orgf484c71">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> tick
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #696969;">))</span>
  <span style="color: #fd971f;">:x!</span> <span style="color: #a6e22e;">:x</span> inc :x<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> number-tree
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span><span style="color: #696969;">)))</span>
  <span style="color: #fd971f;">:t!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:t</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;leaf&gt;</span> <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> <span style="color: #fd971f;">:x!</span> <span style="color: #a6e22e;">:x</span> inc <span style="color: #a6e22e;">:x</span> leaf<span style="color: #696969;">)</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;node&gt;</span> <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> <span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.l</span> number-tree apply <span style="color: #fd971f;">:l!</span>
              <span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.r</span> number-tree apply <span style="color: #fd971f;">:r!</span>
              <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:r</span> node<span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c29b05" class="outline-3">
<h3 id="org5c29b05">number-tree &#x2013; inline and uncurry</h3>
<div class="outline-text-3" id="text-org5c29b05">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> number-tree
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #66d9ef; font-weight: bold;">&lt;int&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span><span style="color: #696969;">))</span>
  <span style="color: #fd971f;">:t!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:t</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;leaf&gt;</span> <span style="color: #797979;">[</span>dup inc swap leaf<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;node&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.l</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">recur</span><span style="color: #696969;">)</span> <span style="color: #fd971f;">:l!</span>
            <span style="color: #a6e22e;">:t</span> <span style="color: #ae81ff;">.r</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">recur</span><span style="color: #696969;">)</span> <span style="color: #fd971f;">:r!</span>
            <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:r</span> node<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1698c4b" class="outline-3">
<h3 id="org1698c4b"><span class="done _test_">[test]</span> number-tree</h3>
<div class="outline-text-3" id="text-org1698c4b">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> test-number-tree
  <span style="color: #ae81ff;">0</span> swap number-tree
  swap drop
  <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> int-write space<span style="color: #696969;">)</span> tree-write newline<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+var</span> tree-1
  <span style="color: #e6db74;">"1"</span> leaf <span style="color: #e6db74;">"2"</span> leaf node
  <span style="color: #e6db74;">"3"</span> leaf <span style="color: #e6db74;">"4"</span> leaf node
  <span style="color: #e6db74;">"5"</span> leaf node
  node<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> tree-1 test-number-tree<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc2b9b62" class="outline-2">
<h2 id="orgc2b9b62">zip-tree</h2>
<div class="outline-text-2" id="text-orgc2b9b62">
</div><div id="outline-container-orge1f10ae" class="outline-3">
<h3 id="orge1f10ae"><span class="todo _note_">[note]</span> </h3>
<div class="outline-text-3" id="text-orge1f10ae">
<ul class="org-ul">
<li><p>the experiment gose in three steps</p><p><ol class="org-ol"></p><p><li>implement the moand</li></p><p><li>inline and simplify</li></p><p><li>uncurry and simplify</li></ol></p></li>

<li><p>here is the experiment applies to maybe monad</p></li></ul>
</div>
</div>

<div id="outline-container-org2cc0a22" class="outline-3">
<h3 id="org2cc0a22">zip-tree &#x2013; do not handle error</h3>
<div class="outline-text-3" id="text-org2cc0a22">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> zip-tree <span style="color: #fd971f;">:t1!</span> <span style="color: #fd971f;">:t2!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #797979;">[</span>tree tree<span style="color: #797979;">]</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #797979;">[</span>tree<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> leaf? <span style="color: #a6e22e;">:t2</span> leaf? and<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.v</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.v</span> cons leaf<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> node? <span style="color: #a6e22e;">:t2</span> node? and<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.l</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.l</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">recur</span><span style="color: #696969;">)</span>
                                   <span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.r</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.r</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">recur</span><span style="color: #696969;">)</span> node<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org27918d9" class="outline-3">
<h3 id="org27918d9">zip-tree &#x2013; maybe</h3>
<div class="outline-text-3" id="text-org27918d9">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> zip-tree <span style="color: #fd971f;">:t1!</span> <span style="color: #fd971f;">:t2!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;maybe&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> leaf? <span style="color: #a6e22e;">:t2</span> leaf? and<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.v</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.v</span> cons leaf just<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> node? <span style="color: #a6e22e;">:t2</span> node? and<span style="color: #797979;">]</span>
        <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.l</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.l</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">recur</span><span style="color: #696969;">)</span> dup <span style="color: #fd971f;">:lm!</span><span style="color: #797979;">]</span>
          <span style="color: #66d9ef; font-weight: bold;">&lt;nothing&gt;</span> nothing
          <span style="color: #66d9ef; font-weight: bold;">&lt;just&gt;</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.r</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.r</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">recur</span><span style="color: #696969;">)</span> dup <span style="color: #fd971f;">:rm!</span><span style="color: #797979;">]</span>
                   <span style="color: #66d9ef; font-weight: bold;">&lt;nothing&gt;</span> nothing
                   <span style="color: #66d9ef; font-weight: bold;">&lt;just&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:lm</span> <span style="color: #ae81ff;">.v</span> <span style="color: #a6e22e;">:rm</span> <span style="color: #ae81ff;">.v</span> node just<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
        <span style="color: #66d9ef; font-weight: bold;">else</span> nothing<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
