docs/inlining-monads.org
*** zip-tree -- maybe monad

    #+begin_src jojo :tangle no
    (+jojo return-maybe just)

    (+jojo bind-maybe :f! :m!
      (case :m
        <nothing> nothing
        <just> [:m .v :f apply]))

    (+jojo zip-tree :t1! :t2!
      (note (-> :<t> <tree> :<t> <tree> -- [:<t> <tree> <maybe>]))
      (cond [:t1 leaf? :t2 leaf? and]
            [:t1 .v :t2 .v cons leaf return-maybe]
            [:t1 node? :t2 node? and]
            [:t1 .l :t2 .l zip-tree
             (% :l! :t1 .r :t2 .r zip-tree
                (% :r! :l :r node return-maybe)
                bind-maybe)
             bind-maybe]
            else nothing))
    #+end_src

*** [test] zip-tree -- maybe

    #+begin_src jojo
    (+jojo maybe-write :f! :m!
      (case :m
        <nothing> ["nothing" string-write space]
        <just> [:m .v :f apply "just" string-write space]))

    (+jojo test-zip-tree
      zip-tree
      (% (% dup .cdr int-write space
            .car int-write space
            "cons" string-write space)
         tree-write)
      maybe-write)

    (+var tree-2
      1 leaf 2 leaf node
      3 leaf 4 leaf node
      5 leaf node
      node)

    (run tree-2 dup zip-tree
      test-zip-tree)

    (run tree-2 1 leaf
      test-zip-tree)
    #+end_src

*** zip-tree -- inline and uncurry

    #+begin_src jojo
    (+jojo zip-tree :t1! :t2!
      (note (-> :<t> <tree> :<t> <tree> -- [:<t> <tree> | <nothing>]))
      (cond [:t1 leaf? :t2 leaf? and]
            [:t1 .v :t2 .v cons leaf]
            [:t1 node? :t2 node? and]
            [:t1 .l :t2 .l zip-tree (if dup nothing? then end)
             :t1 .r :t2 .r zip-tree (if dup nothing? then end)
             node]
            else nothing))
    #+end_src

*** [test] zip-tree

    #+begin_src jojo
    (+var tree-2
      1 leaf 2 leaf node
      3 leaf 4 leaf node
      5 leaf node
      node)

    (+jojo write-tree-or-nothing
      (if dup nothing? then drop "nothing" string-write end)
      (el (% dup .cdr int-write space
             .car int-write space
             "cons" string-write space)
          tree-write))

    (run
      tree-2 1 leaf zip-tree
      write-tree-or-nothing)

    (run
      1 leaf tree-2 zip-tree
      write-tree-or-nothing)

    (run
      tree-2 1 leaf 1 leaf node zip-tree
      write-tree-or-nothing)

    (run
      1 leaf 1 leaf node tree-2 zip-tree
      write-tree-or-nothing)

    (run
      tree-2 dup zip-tree
      write-tree-or-nothing)
    #+end_src
