docs/inlining-monads.html

<div id="outline-container-org69e2f49" class="outline-3">
<h3 id="org69e2f49">zip-tree &#x2013; maybe monad</h3>
<div class="outline-text-3" id="text-org69e2f49">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> return-maybe just<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> bind-maybe <span style="color: #fd971f;">:f!</span> <span style="color: #fd971f;">:m!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:m</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;nothing&gt;</span> nothing
    <span style="color: #66d9ef; font-weight: bold;">&lt;just&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #ae81ff;">.v</span> <span style="color: #a6e22e;">:f</span> apply<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> zip-tree <span style="color: #fd971f;">:t1!</span> <span style="color: #fd971f;">:t2!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;maybe&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> leaf? <span style="color: #a6e22e;">:t2</span> leaf? and<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.v</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.v</span> cons leaf return-maybe<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> node? <span style="color: #a6e22e;">:t2</span> node? and<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.l</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.l</span> zip-tree
         <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> <span style="color: #fd971f;">:l!</span> <span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.r</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.r</span> zip-tree
            <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> <span style="color: #fd971f;">:r!</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:r</span> node return-maybe<span style="color: #696969;">)</span>
            bind-maybe<span style="color: #696969;">)</span>
         bind-maybe<span style="color: #797979;">]</span>
        <span style="color: #66d9ef; font-weight: bold;">else</span> nothing<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf1cea8" class="outline-3">
<h3 id="orgbf1cea8"><span class="done _test_">[test]</span> zip-tree &#x2013; maybe</h3>
<div class="outline-text-3" id="text-orgbf1cea8">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> maybe-write <span style="color: #fd971f;">:f!</span> <span style="color: #fd971f;">:m!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:m</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;nothing&gt;</span> <span style="color: #797979;">[</span><span style="color: #e6db74;">"nothing"</span> string-write space<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;just&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:m</span> <span style="color: #ae81ff;">.v</span> <span style="color: #a6e22e;">:f</span> apply <span style="color: #e6db74;">"just"</span> string-write space<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> test-zip-tree
  zip-tree
  <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> dup <span style="color: #ae81ff;">.cdr</span> int-write space
        <span style="color: #ae81ff;">.car</span> int-write space
        <span style="color: #e6db74;">"cons"</span> string-write space<span style="color: #696969;">)</span>
     tree-write<span style="color: #696969;">)</span>
  maybe-write<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+var</span> tree-2
  <span style="color: #ae81ff;">1</span> leaf <span style="color: #ae81ff;">2</span> leaf node
  <span style="color: #ae81ff;">3</span> leaf <span style="color: #ae81ff;">4</span> leaf node
  <span style="color: #ae81ff;">5</span> leaf node
  node<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> tree-2 dup zip-tree
  test-zip-tree<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> tree-2 <span style="color: #ae81ff;">1</span> leaf
  test-zip-tree<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1875af6" class="outline-3">
<h3 id="org1875af6">zip-tree &#x2013; inline and uncurry</h3>
<div class="outline-text-3" id="text-org1875af6">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> zip-tree <span style="color: #fd971f;">:t1!</span> <span style="color: #fd971f;">:t2!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span> <span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:&lt;t&gt;</span> <span style="color: #66d9ef; font-weight: bold;">&lt;tree&gt;</span> | <span style="color: #66d9ef; font-weight: bold;">&lt;nothing&gt;</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> leaf? <span style="color: #a6e22e;">:t2</span> leaf? and<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.v</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.v</span> cons leaf<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> node? <span style="color: #a6e22e;">:t2</span> node? and<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.l</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.l</span> zip-tree <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup nothing? <span style="color: #66d9ef; font-weight: bold;">then</span> <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
         <span style="color: #a6e22e;">:t1</span> <span style="color: #ae81ff;">.r</span> <span style="color: #a6e22e;">:t2</span> <span style="color: #ae81ff;">.r</span> zip-tree <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup nothing? <span style="color: #66d9ef; font-weight: bold;">then</span> <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
         node<span style="color: #797979;">]</span>
        <span style="color: #66d9ef; font-weight: bold;">else</span> nothing<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf8a9f6" class="outline-3">
<h3 id="orgcf8a9f6"><span class="done _test_">[test]</span> zip-tree</h3>
<div class="outline-text-3" id="text-orgcf8a9f6">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+var</span> tree-2
  <span style="color: #ae81ff;">1</span> leaf <span style="color: #ae81ff;">2</span> leaf node
  <span style="color: #ae81ff;">3</span> leaf <span style="color: #ae81ff;">4</span> leaf node
  <span style="color: #ae81ff;">5</span> leaf node
  node<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> write-tree-or-nothing
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup nothing? <span style="color: #66d9ef; font-weight: bold;">then</span> drop <span style="color: #e6db74;">"nothing"</span> string-write <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">el</span> <span style="color: #696969;">(</span><span style="color: #ae81ff;">%</span> dup <span style="color: #ae81ff;">.cdr</span> int-write space
         <span style="color: #ae81ff;">.car</span> int-write space
         <span style="color: #e6db74;">"cons"</span> string-write space<span style="color: #696969;">)</span>
      tree-write<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span>
  tree-2 <span style="color: #ae81ff;">1</span> leaf zip-tree
  write-tree-or-nothing<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span>
  <span style="color: #ae81ff;">1</span> leaf tree-2 zip-tree
  write-tree-or-nothing<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span>
  tree-2 <span style="color: #ae81ff;">1</span> leaf <span style="color: #ae81ff;">1</span> leaf node zip-tree
  write-tree-or-nothing<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span>
  <span style="color: #ae81ff;">1</span> leaf <span style="color: #ae81ff;">1</span> leaf node tree-2 zip-tree
  write-tree-or-nothing<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span>
  tree-2 dup zip-tree
  write-tree-or-nothing<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
.
</div>
</body>
</html>
